In [1]:
import pandas as pd
import numpy as np
import pymysql                        
from sqlalchemy import create_engine  
from getpass import getpass

In [2]:
password = getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+ password +'@localhost/sakila'
engine = create_engine(connection_string)

### 1.How many distinct (different) actors' last names are there?

In [4]:
data1 = pd.read_sql_query('SELECT COUNT(DISTINCT last_name) AS distinct_last_names FROM sakila.actor', engine)
data1.head() 
# There are 121 different last names.

   distinct_last_names
0                  121

### 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [5]:
query2 = '''SELECT *, DATE_FORMAT(rental_date, "%%M") AS "month", DATE_FORMAT(rental_date, "%%W") AS "weekday", 
CASE
WHEN (DATE_FORMAT(rental_date, "%%W") = "Saturday") OR (DATE_FORMAT(rental_date, "%%W") = "Sunday") THEN "Weekend"
ELSE "Workday"
END AS   "day type" 
FROM SAKILA.RENTAL
LIMIT 20;''' 
result2 = engine.execute(query2)
pd.DataFrame(result2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,weekday,day type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,May,Tuesday,Workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,May,Tuesday,Workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,May,Tuesday,Workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,May,Tuesday,Workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,May,Tuesday,Workday
5,6,2005-05-24 23:08:07,2792,549,2005-05-27 01:32:07,1,2006-02-15 21:30:53,May,Tuesday,Workday
6,7,2005-05-24 23:11:53,3995,269,2005-05-29 20:34:53,2,2006-02-15 21:30:53,May,Tuesday,Workday
7,8,2005-05-24 23:31:46,2346,239,2005-05-27 23:33:46,2,2006-02-15 21:30:53,May,Tuesday,Workday
8,9,2005-05-25 00:00:40,2580,126,2005-05-28 00:22:40,1,2006-02-15 21:30:53,May,Wednesday,Workday
9,10,2005-05-25 00:02:21,1824,399,2005-05-31 22:44:21,2,2006-02-15 21:30:53,May,Wednesday,Workday
10,11,2005-05-25 00:09:02,4443,142,2005-06-02 20:56:02,2,2006-02-15 21:30:53,May,Wednesday,Workday
11,12,2005-05-25 00:19:27,1584,261,2005-05-30 05:44:27,2,2006-02-15 21:30:53,May,Wednesday,Workday
12,13,2005-05-25 00:22:55,2294,334,2005-05-30 04:28:55,1,2006-02-15 21:30:53,May,Wednesday,Workday
13,14,2005-05-25 00:31:15,2701,446,2005-05-26 02:56:15,1,2006-02-15 21:30:53,May,Wednesday,Workday
14,15,2005-05-25 00:39:22,3049,319,2005-06-03 03:30:22,1,2006-02-15 21:30:53,May,Wednesday,Workday
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2,2006-02-15 21:30:53,May,Wednesday,Workday
16,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,1,2006-02-15 21:30:53,May,Wednesday,Workday
17,18,2005-05-25 01:10:47,3376,19,2005-05-31 06:35:47,2,2006-02-15 21:30:53,May,Wednesday,Workday
18,19,2005-05-25 01:17:24,1941,456,2005-05-31 06:00:24,1,2006-02-15 21:30:53,May,Wednesday,Workday
19,20,2005-05-25 01:48:41,3517,185,2005-05-27 02:20:41,2,2006-02-15 21:30:53,May,Wednesday,Workday

### 3.Get all films with ARMAGEDDON in the title.

In [6]:
data3 = pd.read_sql_query('''SELECT title FROM sakila.film WHERE title LIKE "%%ARMAGEDDON%%"''', engine)
data3.head()

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON

### 4.Get 10 the longest films.

In [7]:
data4 = pd.read_sql_query('SELECT title FROM sakila.film ORDER BY LENGTH(title) DESC LIMIT 10;', engine)
data4.head(10) 
# I decided that with longest films wanted to say the longest name, so this are the films with longest names.

                         title
0  ARACHNOPHOBIA ROLLERCOASTER
1    SATISFACTION CONFIDENTIAL
2      ENTRAPMENT SATISFACTION
3      DESPERATE TRAINSPOTTING
4      EXTRAORDINARY CONQUERER
5      TRAINSPOTTING STRANGERS
6       GOLDFINGER SENSIBILITY
7       INTOLERABLE INTENTIONS
8       CONFIDENTIAL INTERVIEW
9       DELIVERANCE MULHOLLAND

### 5.How many films include Behind the Scenes content?

In [8]:
data5 = pd.read_sql_query('SELECT COUNT(SPECIAL_FEATURES) FROM sakila.film WHERE special_features LIKE "%%Behind the scene%%";', engine)
display (data5.head())
data5.shape

   COUNT(SPECIAL_FEATURES)
0                      538

(1, 1)

### 6.Which kind of movies (rating) have a mean duration of more than two hours?

In [9]:
data6 = pd.read_sql_query('SELECT rating, ROUND(AVG(length),2) AS mean_length \
FROM sakila.film \
GROUP BY rating \
HAVING ROUND(AVG(length),2) > 120;', engine)
data6.head()

  rating  mean_length
0  PG-13       120.44

### 7.Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [10]:
data7 = pd.read_sql_query('SELECT title, length, RANK() OVER(ORDER BY length DESC) AS ranking FROM sakila.film;', engine)
data7.head(20)

                 title  length  ranking
0        CHICAGO NORTH     185        1
1       CONTROL ANTHEM     185        1
2       DARN FORRESTER     185        1
3          GANGS PRIDE     185        1
4            HOME PITY     185        1
5        MUSCLE BRIGHT     185        1
6         POND SEATTLE     185        1
7   SOLDIERS EVOLUTION     185        1
8    SWEET BROTHERHOOD     185        1
9         WORST BANGER     185        1
10   CONSPIRACY SPIRIT     184       11
11    CRYSTAL BREAKING     184       11
12      KING EVOLUTION     184       11
13     MOONWALKER FOOL     184       11
14     SMOOCHY CONTROL     184       11
15      SONS INTERVIEW     184       11
16      SORORITY QUEEN     184       11
17      THEORY MERMAID     184       11
18       CATCH AMISTAD     183       19
19      FRONTIER CABIN     183       19